# CwpSplitColumnsAtLevels Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpSplitColumnsAtLevels Property
ParameterTypeId Class See Also
---
"Split Columns by Levels"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpSplitColumnsAtLevels { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpSplitColumnsAtLevels As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpSplitColumnsAtLevels {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace